IOsetting/py32f0-template/Misc/SVD/py32f002xx.svd
				<register>
					<name>BRR</name>
					<displayName>BRR</displayName>
					<description>port bit reset register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BR8</name>
							<description>Port Reset bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR7</name>
							<description>Port Reset bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR6</name>
							<description>Port Reset bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR5</name>
							<description>Port Reset bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR4</name>
							<description>Port Reset bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR3</name>
							<description>Port Reset bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR2</name>
							<description>Port Reset bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR1</name>
							<description>Port Reset bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR0</name>
							<description>Port Reset bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral derivedFrom="GPIOB">
			<name>GPIOC</name>
			<baseAddress>0x50000800</baseAddress>
		</peripheral>
		<peripheral>
			<name>EXTI</name>
			<description>External interrupt/event
			controller</description>
			<groupName>EXTI</groupName>
			<baseAddress>0x40021800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EXTI0_1</name>
				<description>EXTI Line 0 and 1 Interrupt</description>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>EXTI2_3</name>
				<description>EXTI Line 2 and 3 Interrupt</description>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>EXTI4_15</name>
				<description>EXTI Line 4 to 15 Interrupt</description>
				<value>7</value>
			</interrupt>
			<registers>
				<register>
					<name>RTSR</name>
					<displayName>RTSR</displayName>
					<description>EXTI rising trigger selection
					register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RT7</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT6</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT5</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT4</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT3</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT2</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT1</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT0</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FTSR</name>
					<displayName>FTSR</displayName>
					<description>EXTI falling trigger selection
					register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FT7</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT6</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT5</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT4</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT3</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT2</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT1</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT0</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SWIER</name>
					<displayName>SWIER</displayName>
					<description>EXTI software interrupt event
					register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SWI7</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI6</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI5</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI4</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI3</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI2</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI1</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI0</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PR</name>
					<displayName>PR</displayName>
					<description>EXTI  pending
					register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PR7</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR6</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR5</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR4</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR3</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR2</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR1</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR0</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTICR1</name>
					<displayName>EXTICR1</displayName>
					<description>EXTI external interrupt selection
					register</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI3</name>
							<description>GPIO port selection</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EXTI2</name>
							<description>GPIO port selection</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EXTI1</name>
							<description>GPIO port selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EXTI0</name>
							<description>GPIO port selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTICR2</name>
					<displayName>EXTICR2</displayName>
					<description>EXTI external interrupt selection
					register</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI7</name>
							<description>GPIO port selection</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTI6</name>
							<description>GPIO port selection</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTI5</name>
							<description>GPIO port selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTI4</name>
							<description>GPIO port selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IMR</name>
					<displayName>IMR</displayName>
					<description>EXTI CPU wakeup with interrupt mask
					register</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFF80000</resetValue>
					<fields>
						<field>
							<name>IM29</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM7</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM6</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM5</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM4</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM3</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM2</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM1</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM0</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EMR</name>
					<displayName>EMR</displayName>
					<description>EXTI CPU wakeup with event mask
					register</description>
					<addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EM29</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM7</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM6</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM5</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM4</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM3</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM2</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM1</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM0</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
