IOsetting/py32f0-template/Misc/SVD/py32f002xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SYSCFG</name>
			<description>System configuration controller</description>
			<groupName>SYSCFG</groupName>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x30</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CFGR1</name>
					<displayName>CFGR1</displayName>
					<description>SYSCFG configuration register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>I2C_PB6_FMP</name>
							<description>desc I2C_PB6_FMP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C_PB4_FMP</name>
							<description>desc I2C_PB4_FMP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C_PB3_FMP</name>
							<description>desc I2C_PB3_FMP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C_PA2_FMP</name>
							<description>desc I2C_PA2_FMP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MEM_MODE</name>
							<description>Memory mapping selection bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR2</name>
					<displayName>CFGR2</displayName>
					<description>SYSCFG configuration register
						2</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ETR_SRC_TIM1</name>
							<description>TIM1 ETR source selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>LOCKUP_LOCK</name>
							<description>Cortex-M0+ LOCKUP bit enable
								bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIO_ENS</name>
					<description>desc GPIO_ENS</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PC_ENS</name>
							<description>desc PC_ENS</description>
							<msb>17</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PB_ENS</name>
							<description>desc PB_ENS</description>
							<msb>15</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PA_ENS</name>
							<description>desc PA_ENS</description>
							<msb>7</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>FLASH</name>
			<description>Flash</description>
			<groupName>Flash</groupName>
			<baseAddress>0x40022000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>FLASH</name>
				<description>FLASH global Interrupt</description>
				<value>3</value>
			</interrupt>
			<registers>
				<register>
					<name>ACR</name>
					<displayName>ACR</displayName>
					<description>Access control register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000600</resetValue>
					<fields>
						<field>
							<name>LATENCY</name>
							<description>Latency</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR</name>
					<displayName>KEYR</displayName>
					<description>Flash key register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>KEY</name>
							<description>Flash key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OPTKEYR</name>
					<displayName>OPTKEYR</displayName>
					<description>Option byte key register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OPTKEY</name>
							<description>Option byte key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BSY</name>
							<description>Busy</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OPTVERR</name>
							<description>Option and Engineering bits loading
							validity error</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WRPERR</name>
							<description>Write protected error</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOP</name>
							<description>End of operation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Flash control register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xC0000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>FLASH_CR Lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OPTLOCK</name>
							<description>Options Lock</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OBL_LAUNCH</name>
							<description>Force the option byte
							loading</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ERRIE</name>
							<description>Error interrupt enable</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOPIE</name>
							<description>End of operation interrupt
							enable</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PGTSTRT</name>
							<description>Flash main memory program start</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OPTSTRT</name>
							<description>Option byte program start</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SER</name>
							<description>Sector erase</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MER</name>
							<description>Mass erase</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PER</name>
							<description>Page erase</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PG</name>
							<description>Programming</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OPTR</name>
					<displayName>OPTR</displayName>
					<description>Flash option register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x4F55B0AA</resetValue>
					<fields>
						<field>
							<name>nBOOT1</name>
							<description>Boot configuration</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NRST_MODE</name>
							<description>NRST_MODE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDG_SW</name>
							<description>Window watchdog selection</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG_SW</name>
							<description>Independent watchdog
							selection</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BORF_LEV</name>
							<description>These bits contain the VDD supply level
							threshold that activates the reset</description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>BOREN</name>
							<description>BOR reset Level</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RDP</name>
							<description>Read Protection </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SDKR</name>
					<displayName>SDKR</displayName>
					<description>Flash SDK address 
					register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFE0001F</resetValue>
					<fields>
						<field>
							<name>SDK_END</name>
							<description>SDK area end address</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SDK_STRT</name>
							<description>SDK area start address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BTCR</name>
					<displayName>SDKR</displayName>
					<description>FLASH boot control register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>BOOT0</name>
							<description>desc BOOT0</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BOOT_SIZE</name>
							<description>desc BOOT_SIZE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>WRPR</name>
					<displayName>WRPR</displayName>
					<description>Flash WRP address
					register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<fields>
						<field>
							<name>WRP</name>
							<description>WRP address </description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STCR</name>
					<displayName>STCR</displayName>
					<description>Flash sleep time config
					register</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00006400</resetValue>
					<fields>
						<field>
							<name>SLEEP_TIME</name>
							<description>FLash sleep time configuration(counter based on HSI_10M)</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>SLEEP_EN</name>
							<description>FLash sleep enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TS0</name>
					<displayName>TS0</displayName>
					<description>Flash TS0 
					register</description>
					<addressOffset>0x100</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000B4</resetValue>
					<fields>
						<field>
							<name>TS0</name>
							<description>FLash TS0 register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TS1</name>
					<displayName>TS1</displayName>
					<description>Flash TS1 
					register</description>
					<addressOffset>0x104</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000001B0</resetValue>
					<fields>
						<field>
							<name>TS1</name>
							<description>FLash TS1 register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TS2P</name>
					<displayName>TS2P</displayName>
					<description>Flash TS2P 
					register</description>
					<addressOffset>0x108</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000B4</resetValue>
					<fields>
						<field>
							<name>TS2P</name>
							<description>FLash TS2P register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TPS3</name>
					<displayName>TPS3</displayName>
					<description>Flash TPS3 
					register</description>
					<addressOffset>0x10C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000006C0</resetValue>
					<fields>
						<field>
							<name>TPS3</name>
							<description>FLash TPS3 register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TS3</name>
					<displayName>TS3</displayName>
					<description>Flash TS3 
					register</description>
					<addressOffset>0x110</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000B4</resetValue>
					<fields>
						<field>
							<name>TS3</name>
							<description>FLash TS3 register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PERTPE</name>
					<displayName>PERTPE</displayName>
					<description>Flash PERTPE 
					register</description>
					<addressOffset>0x114</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000EA60</resetValue>
					<fields>
						<field>
							<name>PERTPE</name>
							<description>FLash PERTPE register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>17</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SMERTPE</name>
					<displayName>SMERTPE</displayName>
					<description>Flash SMERTPE 
					register</description>
					<addressOffset>0x118</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000FD20</resetValue>
					<fields>
						<field>
							<name>SMERTPE</name>
							<description>FLash SMERTPE register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>17</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PRGTPE</name>
					<displayName>PRGTPE</displayName>
					<description>Flash PRGTPE 
					register</description>
					<addressOffset>0x11C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00008CA0</resetValue>
					<fields>
						<field>
							<name>PRGTPE</name>
							<description>FLash PRGTPE register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PRETPE</name>
					<displayName>PRETPE</displayName>
					<description>Flash PRETPE 
					register</description>
					<addressOffset>0x120</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000012C0</resetValue>
					<fields>
						<field>
							<name>PRETPE</name>
							<description>FLash PRETPE register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
					</fields>
				</register>
