IOsetting/py32f0-template/Misc/SVD/py32f002xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CRC</name>
			<description>CRC calculation unit</description>
			<groupName>CRC</groupName>
			<baseAddress>0x40023000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DR</name>
					<displayName>DR</displayName>
					<description>Data register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>DR</name>
							<description>Data Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IDR</name>
					<displayName>IDR</displayName>
					<description>Independent Data register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IDR</name>
							<description>Independent Data register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RESET</name>
							<description>Reset bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>SPI1</name>
			<description>Serial peripheral interface</description>
			<groupName>SPI</groupName>
			<baseAddress>0x40013000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SPI1</name>
				<description>SPI1 global Interrupt</description>
				<value>25</value>
			</interrupt>
			<registers>
				<register>
					<name>CR1</name>
					<description>desc CR1</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>CPHA</name>
							<description>desc CPHA</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPOL</name>
							<description>desc CPOL</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSTR</name>
							<description>desc MSTR</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>BR</name>
							<description>desc BR</description>
							<msb>5</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPE</name>
							<description>desc SPE</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LSBFIRST</name>
							<description>desc LSBFIRST</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SSI</name>
							<description>desc SSI</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SSM</name>
							<description>desc SSM</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXONLY</name>
							<description>desc RXONLY</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DDF</name>
							<description>desc DDF</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRCNEXT</name>
							<description>desc CRCNEXT</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRCEN</name>
							<description>desc CRCEN</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>BIDIOE</name>
							<description>desc BIDIOE</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>BIDIMODE</name>
							<description>desc BIDIMODE</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR2</name>
					<description>desc CR2</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>RXDMAEN</name>
							<description>desc RXDMAEN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXDMAEN</name>
							<description>desc TXDMAEN</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SSOE</name>
							<description>desc SSOE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLRTXFIFO</name>
							<description>desc CLRTXFIFO</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERRIE</name>
							<description>desc ERRIE</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXNEIE</name>
							<description>desc RXNEIE</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXEIE</name>
							<description>desc TXEIE</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>FRXTH</name>
							<description>desc FRXTH</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LDMA_RX</name>
							<description>desc LDMA_RX</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LDMA_TX</name>
							<description>desc LDMA_TX</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<description>desc SR</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x2</resetValue>
					<fields>
						<field>
							<name>RXNE</name>
							<description>desc RXNE</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXE</name>
							<description>desc TXE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHSIDE</name>
							<description>desc CHSIDE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>UDR</name>
							<description>desc UDR</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRCERR</name>
							<description>desc CRCERR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MODF</name>
							<description>desc MODF</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR</name>
							<description>desc OVR</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>BSY</name>
							<description>desc BSY</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FRLVL</name>
							<description>desc FRLVL</description>
							<msb>10</msb>
							<lsb>9</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FTLVL</name>
							<description>desc FTLVL</description>
							<msb>12</msb>
							<lsb>11</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DR</name>
					<description>desc DR</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DR</name>
							<description>desc DR</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CRCPR</name>
					<description>desc CRCPR</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x7</resetValue>
					<fields>
						<field>
							<name>CRCPOLY</name>
							<description>desc CRCPOLY</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXCRCR</name>
					<description>desc RXCRCR</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>RXCRC</name>
							<description>desc RXCRC</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXCRCR</name>
					<description>desc TXCRCR</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>TXCRC</name>
							<description>desc TXCRC</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I2SCFGR</name>
					<description>desc I2SCFGR</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>CHLEN</name>
							<description>desc CHLEN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DATLEN</name>
							<description>desc DATLEN</description>
							<msb>2</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CKPOL</name>
							<description>desc CKPOL</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>I2SSTD</name>
							<description>desc I2SSTD</description>
							<msb>5</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PCMSYNC</name>
							<description>desc PCMSYNC</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>I2SCFG</name>
							<description>desc I2SCFG</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>I2SE</name>
							<description>desc I2SE</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>I2SMOD</name>
							<description>desc I2SMOD</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I2SPR</name>
					<description>desc I2SPR</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x2</resetValue>
					<fields>
						<field>
							<name>I2SDIV</name>
							<description>desc I2SDIV</description>
							<msb>7</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ODD</name>
							<description>desc ODD</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MCKOE</name>
							<description>desc MCKOE</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
