IOsetting/py32f0-template/Misc/SVD/py32f002xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DBGMCU</name>
			<description>Debug support</description>
			<groupName>DBGMCU</groupName>
			<baseAddress>0x40015800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IDCODE</name>
					<displayName>IDCODE</displayName>
					<description>MCU Device ID Code Register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>REV_ID</name>
							<description>REV_ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Debug MCU Configuration Register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DBG_SLEEP</name>
							<description>Debug Sleep Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_STOP</name>
							<description>Debug Stop Mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APB_FZ1</name>
					<displayName>APB_FZ1</displayName>
					<description>APB Freeze Register1</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DBG_TIM6_STOP</name>
							<description>Debug TIM 6 stopped whenCore is halted</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_IWDG_STOP</name>
							<description>Debug Independent Wachdog stopped whenCore is halted</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_I2C1_TIMEOUT</name>
							<description>Debug I2C1 TIMEOUT stopped when Core ishalted</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_LPTIM_STOP</name>
							<description>Debug LPTIM stopped when Core ishalted</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APB_FZ2</name>
					<displayName>APB_FZ2</displayName>
					<description>APB Freeze Register2</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DBG_TIMER1_STOP</name>
							<description>Debug Timer 1 stopped when Core ishalted</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>
